jmeter/results/replica-only/report/statistics.json
{
  "GET /user/get/{id}" : {
    "transaction" : "GET /user/get/{id}",
    "sampleCount" : 5403,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 410.6172496761061,
    "medianResTime" : 471.0,
    "minResTime" : 0.0,
    "maxResTime" : 778.0,
    "pct1ResTime" : 608.0,
    "pct2ResTime" : 655.0,
    "pct3ResTime" : 720.0,
    "throughput" : 89.39739898739204,
    "receivedKBytesPerSec" : 20.79109609227638,
    "sentKBytesPerSec" : 15.277875803509382
  },
  "GET /user/search" : {
    "transaction" : "GET /user/search",
    "sampleCount" : 3161,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 778.1705156596028,
    "medianResTime" : 789.0,
    "minResTime" : 26.0,
    "maxResTime" : 1953.0,
    "pct1ResTime" : 1152.0,
    "pct2ResTime" : 1288.0,
    "pct3ResTime" : 1519.9000000000005,
    "throughput" : 52.00809490119943,
    "receivedKBytesPerSec" : 147.28572214498428,
    "sentKBytesPerSec" : 12.460069215929844
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 8564,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 546.282344698739,
    "medianResTime" : 532.0,
    "minResTime" : 0.0,
    "maxResTime" : 1953.0,
    "pct1ResTime" : 946.5,
    "pct2ResTime" : 1096.75,
    "pct3ResTime" : 1364.7000000000007,
    "throughput" : 140.90393063393606,
    "receivedKBytesPerSec" : 167.96016999086854,
    "sentKBytesPerSec" : 27.6522286429112
  }
}