jmeter/results/test3-kill-app/report/statistics.json
{
  "GET /user/get/{id}" : {
    "transaction" : "GET /user/get/{id}",
    "sampleCount" : 10515,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 316.47265810746774,
    "medianResTime" : 363.0,
    "minResTime" : 0.0,
    "maxResTime" : 1355.0,
    "pct1ResTime" : 434.0,
    "pct2ResTime" : 476.0,
    "pct3ResTime" : 1002.0,
    "throughput" : 116.59625428295799,
    "receivedKBytesPerSec" : 32.34246182068682,
    "sentKBytesPerSec" : 17.648847083846178
  },
  "GET /user/search" : {
    "transaction" : "GET /user/search",
    "sampleCount" : 5869,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 647.3320838302944,
    "medianResTime" : 642.0,
    "minResTime" : 27.0,
    "maxResTime" : 1727.0,
    "pct1ResTime" : 861.0,
    "pct2ResTime" : 942.0,
    "pct3ResTime" : 1232.9000000000005,
    "throughput" : 64.93477755772656,
    "receivedKBytesPerSec" : 184.30878438838056,
    "sentKBytesPerSec" : 14.275447954814512
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 16384,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 434.99157714843705,
    "medianResTime" : 394.0,
    "minResTime" : 0.0,
    "maxResTime" : 1727.0,
    "pct1ResTime" : 758.0,
    "pct2ResTime" : 842.0,
    "pct3ResTime" : 1060.1499999999996,
    "throughput" : 181.2730270072912,
    "receivedKBytesPerSec" : 216.57967863149045,
    "sentKBytesPerSec" : 31.885241572668534
  }
}